package Prakt_5;
/*
Розробити абстрактний клас Figure з двома абстрактними методами –
підрахунок площі фігури та периметру. Успадкувати від нього класи
Rectangle (прямокутник), Circle (коло) та Triangle (трикутник). У класі
Rectangle створити додатковий метод обчислення довжини діагоналі.
В main створити масив різних фігур та забезпечити обчислення
периметра та площі кожної фігури залежно від її типу. А для фігур
типу Rectangle також вивести довжину діагоналі.
 */

public class Main {
    public static void main(String[] args) {

    }
}
